In [77]:
import pandas as pd
import numpy as np

### Creating csv file

In [5]:
frnds ={"Name":["F1","F2","F3"],
        "Age":[20,21,22],
        "City":["C1","C2","C3"]}
df = pd.DataFrame(frnds)
df

  Name  Age City
0   F1   20   C1
1   F2   21   C2
2   F3   22   C3

In [8]:
df.to_csv("Friends.csv",index=False)

In [9]:
df2 = pd.read_csv("Friends.csv")
df2

  Name  Age City
0   F1   20   C1
1   F2   21   C2
2   F3   22   C3

### Reading csv from internet

In [5]:
import pandas as pd

# Define column names from UCI Auto MPG dataset
column_names = [
    "mpg", "cylinders", "displacement", "horsepower", "weight",
    "acceleration", "model_year", "origin", "car_name"
]

# URL of Auto MPG dataset
url = "https://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data"

# Load dataset
df = pd.read_csv(
    url,
    sep='\s+',   # data separated by spaces
    names=column_names,      # assign column names
    na_values="?"            # missing values marked as '?'
)

# Save to local CSV file
df.to_csv("auto_mpg.csv", index=False)

print("✅ Auto MPG dataset saved as 'auto_mpg.csv'")
print(df.head())

✅ Auto MPG dataset saved as 'auto_mpg.csv'
    mpg  cylinders  displacement  horsepower  weight  acceleration  \
0  18.0          8         307.0       130.0  3504.0          12.0
1  15.0          8         350.0       165.0  3693.0          11.5
2  18.0          8         318.0       150.0  3436.0          11.0
3  16.0          8         304.0       150.0  3433.0          12.0
4  17.0          8         302.0       140.0  3449.0          10.5

   model_year  origin                   car_name
0          70       1  chevrolet chevelle malibu
1          70       1          buick skylark 320
2          70       1         plymouth satellite
3          70       1              amc rebel sst
4          70       1                ford torino

In [3]:
url = "https://support.staffbase.com/hc/en-us/article_attachments/360009197031/username.csv"
df3 = pd.read_csv(url,sep=";")
df3.head(10)

    Username   Identifier First name Last name
0   booker12         9012     Rachel    Booker
1     grey07         2070      Laura      Grey
2  johnson81         4081      Craig   Johnson
3  jenkins46         9346       Mary   Jenkins
4    smith79         5079      Jamie     Smith

In [28]:
import pandas as pd

# Define column names from UCI Auto MPG dataset
column_names = [
    "mpg", "cylinders", "displacement", "horsepower", "weight",
    "acceleration", "model_year", "origin", "car_name"
]

# URL of Auto MPG dataset
url = "https://archive.ics.uci.edu/ml/machine-learning-databases/auto-mpg/auto-mpg.data"

# Load dataset
df = pd.read_csv(
    url,
    sep='\s+',   # data separated by spaces
    names=column_names,      # assign column names
    na_values="?"            # missing values marked as '?'
)

# Save to local CSV file
df.to_csv("auto_mpg.csv", index=False)

print("✅ Auto MPG dataset saved as 'auto_mpg.csv'")
print(df.head())

✅ Auto MPG dataset saved as 'auto_mpg.csv'
    mpg  cylinders  displacement  horsepower  weight  acceleration  \
0  18.0          8         307.0       130.0  3504.0          12.0
1  15.0          8         350.0       165.0  3693.0          11.5
2  18.0          8         318.0       150.0  3436.0          11.0
3  16.0          8         304.0       150.0  3433.0          12.0
4  17.0          8         302.0       140.0  3449.0          10.5

   model_year  origin                   car_name
0          70       1  chevrolet chevelle malibu
1          70       1          buick skylark 320
2          70       1         plymouth satellite
3          70       1              amc rebel sst
4          70       1                ford torino

In [10]:
df.head(50)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino
5,15.0,8,429.0,198.0,4341.0,10.0,70,1,ford galaxie 500
6,14.0,8,454.0,220.0,4354.0,9.0,70,1,chevrolet impala
7,14.0,8,440.0,215.0,4312.0,8.5,70,1,plymouth fury iii
8,14.0,8,455.0,225.0,4425.0,10.0,70,1,pontiac catalina
9,15.0,8,390.0,190.0,3850.0,8.5,70,1,amc ambassador dpl
10,15.0,8,383.0,170.0,3563.0,10.0,70,1,dodge challenger se
11,14.0,8,340.0,160.0,3609.0,8.0,70,1,plymouth 'cuda 340
12,15.0,8,400.0,150.0,3761.0,9.5,70,1,chevrolet monte carlo
13,14.0,8,455.0,225.0,3086.0,10.0,70,1,buick estate wagon (sw)
14,24.0,4,113.0,95.00,2372.0,15.0,70,3,toyota corona mark ii
15,22.0,6,198.0,95.00,2833.0,15.5,70,1,plymouth duster
16,18.0,6,199.0,97.00,2774.0,15.5,70,1,amc hornet
17,21.0,6,200.0,85.00,2587.0,16.0,70,1,ford maverick
18,27.0,4,97.0,88.00,2130.0,14.5,70,3,datsun pl510
19,26.0,4,97.0,46.00,1835.0,20.5,70,2,volkswagen 1131 deluxe sedan
20,25.0,4,110.0,87.00,2672.0,17.5,70,2,peugeot 504
21,24.0,4,107.0,90.00,2430.0,14.5,70,2,audi 100 ls
22,25.0,4,104.0,95.00,2375.0,17.5,70,2,saab 99e
23,26.0,4,121.0,113.0,2234.0,12.5,70,2,bmw 2002
24,21.0,6,199.0,90.00,2648.0,15.0,70,1,amc gremlin
25,10.0,8,360.0,215.0,4615.0,14.0,70,1,ford f250
26,10.0,8,307.0,200.0,4376.0,15.0,70,1,chevy c20
27,11.0,8,318.0,210.0,4382.0,13.5,70,1,dodge d200
28,9.0,8,304.0,193.0,4732.0,18.5,70,1,hi 1200d
29,27.0,4,97.0,88.00,2130.0,14.5,71,3,datsun pl510
30,28.0,4,140.0,90.00,2264.0,15.5,71,1,chevrolet vega 2300
31,25.0,4,113.0,95.00,2228.0,14.0,71,3,toyota corona
32,25.0,4,98.0,?,2046.0,19.0,71,1,ford pinto
33,19.0,6,232.0,100.0,2634.0,13.0,71,1,amc gremlin
34,16.0,6,225.0,105.0,3439.0,15.5,71,1,plymouth satellite custom
35,17.0,6,250.0,100.0,3329.0,15.5,71,1,chevrolet chevelle malibu
36,19.0,6,250.0,88.00,3302.0,15.5,71,1,ford torino 500
37,18.0,6,232.0,100.0,3288.0,15.5,71,1,amc matador
38,14.0,8,350.0,165.0,4209.0,12.0,71,1,chevrolet impala
39,14.0,8,400.0,175.0,4464.0,11.5,71,1,pontiac catalina brougham
40,14.0,8,351.0,153.0,4154.0,13.5,71,1,ford galaxie 500
41,14.0,8,318.0,150.0,4096.0,13.0,71,1,plymouth fury iii
42,12.0,8,383.0,180.0,4955.0,11.5,71,1,dodge monaco (sw)
43,13.0,8,400.0,170.0,4746.0,12.0,71,1,ford country squire (sw)
44,13.0,8,400.0,175.0,5140.0,12.0,71,1,pontiac safari (sw)
45,18.0,6,258.0,110.0,2962.0,13.5,71,1,amc hornet sportabout (sw)
46,22.0,4,140.0,72.00,2408.0,19.0,71,1,chevrolet vega (sw)
47,19.0,6,250.0,100.0,3282.0,15.0,71,1,pontiac firebird
48,18.0,6,250.0,88.00,3139.0,14.5,71,1,ford mustang
49,23.0,4,122.0,86.00,2220.0,14.0,71,1,mercury capri 2000

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    398 non-null    object
 4   weight        398 non-null    float64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    int64
 8   car_name      398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [15]:
df.describe() #only applicable for numerical data

,mpg,cylinders,displacement,weight,acceleration,model_year,origin
count,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,2970.424623,15.568090,76.010050,1.572864
std,7.815984,1.701004,104.269838,846.841774,2.757689,3.697627,0.802055
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,104.250000,2223.750000,13.825000,73.000000,1.000000
50%,23.000000,4.000000,148.500000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,262.000000,3608.000000,17.175000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [16]:
df.describe(percentiles=[0.3,0.5,0.75])

,mpg,cylinders,displacement,weight,acceleration,model_year,origin
count,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,2970.424623,15.568090,76.010050,1.572864
std,7.815984,1.701004,104.269838,846.841774,2.757689,3.697627,0.802055
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
30%,18.000000,4.000000,112.000000,2301.000000,14.200000,73.000000,1.000000
50%,23.000000,4.000000,148.500000,2803.500000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,262.000000,3608.000000,17.175000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [17]:
df['car_name'].describe()#categorical data

count            398
unique           305
top       ford pinto
freq               6
Name: car_name, dtype: object

In [20]:
df.describe(include="all")#works for both numeric and non-numeric data

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,car_name
count,398.000000,398.000000,398.000000,398,398.000000,398.000000,398.000000,398.000000,398
unique,NaN,NaN,NaN,94,NaN,NaN,NaN,NaN,305
top,NaN,NaN,NaN,150.0,NaN,NaN,NaN,NaN,ford pinto
freq,NaN,NaN,NaN,22,NaN,NaN,NaN,NaN,6
mean,23.514573,5.454774,193.425879,NaN,2970.424623,15.568090,76.010050,1.572864,NaN
std,7.815984,1.701004,104.269838,NaN,846.841774,2.757689,3.697627,0.802055,NaN
min,9.000000,3.000000,68.000000,NaN,1613.000000,8.000000,70.000000,1.000000,NaN
25%,17.500000,4.000000,104.250000,NaN,2223.750000,13.825000,73.000000,1.000000,NaN
50%,23.000000,4.000000,148.500000,NaN,2803.500000,15.500000,76.000000,1.000000,NaN
75%,29.000000,8.000000,262.000000,NaN,3608.000000,17.175000,79.000000,2.000000,NaN
max,46.600000,8.000000,455.000000,NaN,5140.000000,24.800000,82.000000,3.000000,NaN

In [22]:
df.shape #shows rows and columns o/p is in tuple form

(398, 9)

In [23]:
df.shape[0]#represents rows

398

In [24]:
df.shape[1]#represents cols

9

In [25]:
df.columns

Index(['mpg', 'cylinders', 'displacement', 'horsepower', 'weight',
       'acceleration', 'model_year', 'origin', 'car_name'],
      dtype='object')

In [26]:
lst = list(df.columns)
lst

['mpg',
 'cylinders',
 'displacement',
 'horsepower',
 'weight',
 'acceleration',
 'model_year',
 'origin',
 'car_name']

In [30]:
df.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
393    False
394    False
395    False
396    False
397    False
Length: 398, dtype: bool

# Dealing with duplicated values

In [70]:
data = {
    "Name":['A','B','A','C','B','D','A','B','A','C','B','D'],
    "Age":[25,30,25,35,30,40,25,30,25,35,30,40],
    "City":["C1","C2","C1","C3","C2","C4","C1","C2","C1","C3","C2","C4"]
}
dfdp = pd.DataFrame(data)
dfdp

   Name  Age City
0     A   25   C1
1     B   30   C2
2     A   25   C1
3     C   35   C3
4     B   30   C2
5     D   40   C4
6     A   25   C1
7     B   30   C2
8     A   25   C1
9     C   35   C3
10    B   30   C2
11    D   40   C4

In [71]:
dfdp.duplicated()#shows True

0     False
1     False
2      True
3     False
4      True
5     False
6      True
7      True
8      True
9      True
10     True
11     True
dtype: bool

In [72]:
dfdp.drop_duplicates()#keeps the first duplicated value and removes the others(by default keep="first")

  Name  Age City
0    A   25   C1
1    B   30   C2
3    C   35   C3
5    D   40   C4

In [73]:
dfdp.drop_duplicates(keep='last')#keeps the last duplicated value and removes the others

   Name  Age City
8     A   25   C1
9     C   35   C3
10    B   30   C2
11    D   40   C4

In [74]:
#show only the unique values
dfdp.drop_duplicates(keep=False)

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [76]:
#inplace=True
dfdp.drop_duplicates(inplace = True)
dfdp

  Name  Age City
0    A   25   C1
1    B   30   C2
3    C   35   C3
5    D   40   C4

## Removing the particular duplicated values

In [53]:
data = {"Name":["N1","N2","N3","N4","N5","N1","N3"],
       "Age":[25,26,25,26,27,25,25],
       "Sec":["G1","G1","G2","G3","G4","G6","G5"]}
df = pd.DataFrame(data)
df

  Name  Age Sec
0   N1   25  G1
1   N2   26  G1
2   N3   25  G2
3   N4   26  G3
4   N5   27  G4
5   N1   25  G6
6   N3   25  G5

In [57]:
#no duplicate age
df.drop_duplicates(subset=['Age'])

  Name  Age Sec
0   N1   25  G1
1   N2   26  G1
4   N5   27  G4

In [55]:
#no duplicate age and name
df.drop_duplicates(subset=["Name","Age"])

  Name  Age Sec
0   N1   25  G1
1   N2   26  G1
2   N3   25  G2
3   N4   26  G3
4   N5   27  G4

In [61]:
df.drop_duplicates(subset=['Age'],keep=False)

  Name  Age Sec
4   N5   27  G4

In [63]:
#show unique names
names = df.drop_duplicates(subset=['Name'],keep=False)
names

  Name  Age Sec
1   N2   26  G1
3   N4   26  G3
4   N5   27  G4

In [66]:
print(df['Name'].drop_duplicates(keep=False))

1    N2
3    N4
4    N5
Name: Name, dtype: object

## Dealing with missing values

In [78]:
data = {"Name":["N1","N2","N3","N4","N5","N6",np.NaN],
       "Age":[25,26,25,np.NaN,27,25,25],
       "Sec":["G1","G1","G2","G3","G4",np.NaN,"G5"]}
df = pd.DataFrame(data)
df

  Name   Age  Sec
0   N1  25.0   G1
1   N2  26.0   G1
2   N3  25.0   G2
3   N4   NaN   G3
4   N5  27.0   G4
5   N1  25.0  NaN
6  NaN  25.0   G5

In [80]:
df.isna() #where null value exist it will show True

    Name    Age    Sec
0  False  False  False
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False  False
5  False  False   True
6   True  False  False

In [83]:
df.isna().sum()#counts the total no. of null values in each columns

Name    1
Age     1
Sec     1
dtype: int64

### Drop the rows with NaN values

In [86]:
dfn = df.dropna()#removes the rows with null values
dfn

  Name   Age Sec
0   N1  25.0  G1
1   N2  26.0  G1
2   N3  25.0  G2
4   N5  27.0  G4

In [88]:
#drop the null value of a specific col
dfc = df.dropna(subset=['Name'])
dfc

  Name   Age  Sec
0   N1  25.0   G1
1   N2  26.0   G1
2   N3  25.0   G2
3   N4   NaN   G3
4   N5  27.0   G4
5   N1  25.0  NaN

## Filling the NaN values

In [89]:
fill = df.copy()
fill

  Name   Age  Sec
0   N1  25.0   G1
1   N2  26.0   G1
2   N3  25.0   G2
3   N4   NaN   G3
4   N5  27.0   G4
5   N1  25.0  NaN
6  NaN  25.0   G5

In [95]:
fill['Name'].fillna("unknown",inplace=True)
fill['Age'].fillna(0,inplace=True)
fill['Sec'].fillna("not defined",inplace=True)
fill

      Name   Age          Sec
0       N1  25.0           G1
1       N2  26.0           G1
2       N3  25.0           G2
3       N4   0.0           G3
4       N5  27.0           G4
5       N1  25.0  not defined
6  unknown  25.0           G5